import Data.List (intercalate)

doubleMe :: Num a => a -> a
doubleMe x = x + x

doubleUs :: Num a => a -> a -> a
doubleUs x y = x*2 + y*2

doubleSmallNumber x = if x > 100
                        then x
                        else x*2

lostNumbers = [4, 8, 15, 16, 23, 42]

------------------------------------------------------------------------------------------

-- Медленно (копируем каждый раз)
slowConcat = "Hello" ++ " " ++ "world" ++ "!" -- Каждый `++` может копировать всё, что слева.

-- Быстро (используем правильный инструмент - список и `concat`, или `Text.Builder`)
fastConcat = intercalate " " ["Hello", "world", "!"] -- Собираем из готовых частей

-- Или используем специализированный тип `Text` с его эффективным `Builder`.

-----------------------------------------------------------------------------------------

-- Сумма элементов списка
sumList :: Num a => [a] -> a
sumList [] = 0                   -- Базовый случай: пустой список
sumList (x:xs) = x + sumList xs  -- Рекурсивный случай: голова + сумма хвоста

-- pYB-cS3-dHs-BXE

b :: [[Integer]]
b = [[1,2,3,4], [5,3,3,3], [1,2,3,3,4], [1,2,3]]

c :: [[Integer]]
c = b ++ [[1,1,1,1]]

d :: [[Integer]]
d = [6,6,6] : b

el :: [Integer]
el = b !! 2

ex31_1 :: Bool
ex31_1 = [3,4,2] < [3,4,3]

ex32_1 :: Bool
ex32_1 = [3,2,1] > [2,1,0]



